/* 
  Model.strings
  Secrets

  Created by Paulo Andrade on 23/01/14.
  Copyright (c) 2016 Outer Corner. All rights reserved.
*/


// Generic
"Generic.InvalidValue" = "Valeur invalide pour %@";
"Generic.CreationDate" = "Créé";
"Generic.ModificationDate" = "Modifié";
"Generic.Notes" = "Notes";
"Generic.Tags" = "Tags";
"Generic.Secret.Single" = "Secret";
"Generic.Secret.Plural" = "Secrets";

/* Item title after a copy */
"Generic.CopiedItemName" = "%@ Copie";

// Credentials
"Credential.Single" = "Identification";
"Credential.Plural" = "Identifications";
"Credential.New" = "Nouvelle Identification";
"Credential.Items" = "%d identification(s)";

"Credential.Properties.identifier" = "Nom d'utilisateur";
"Credential.Properties.secret" = "Mot de passe";
"Credential.Properties.secrets" = "Historique des Mots de passe";
"Credential.Properties.services" = "Services";
"Credential.Properties.tags" = "Tags";

// Softwared licenses
"SoftwareLicense.Single" = "Licence de Logiciel";
"SoftwareLicense.Plural" = "Licences de Logiciel";
"SoftwareLicense.Software" = "Logiciel";
"SoftwareLicense.License.Single" = "Licence";
"SoftwareLicense.New" = "Nouvelle Licence";
"SoftwareLicense.Items" = "%d licence(s)";

"SoftwareLicense.Properties.key" = "Clé de Licence";
"SoftwareLicense.Properties.orderNumber" = "Numéro de Commande";
"SoftwareLicense.Properties.orderTotal" = "Total de la Commande";
"SoftwareLicense.Properties.owner" = "Titulaire de la Licence";
"SoftwareLicense.Properties.publisher" = "Éditeur";
"SoftwareLicense.Properties.purchaseDate" = "Date d'Achat";
"SoftwareLicense.Properties.supportEmail" = "E-mail de l'Assistance";
"SoftwareLicense.Properties.version" = "Version du Logiciel";
"SoftwareLicense.Properties.website" = "Site Internet";

// Wallet
"Wallet.Single" = "Portefeuille";
"WalletItem.Single" = "Élément de Portefeuille";
"WalletItem.Plural" = "Éléments de Portefeuille";
"Wallet.Items" = "%d élément(s) de portefeuille";

// Bank Account
"BankAccount.Single" = "Compte Bancaire";
"BankAccount.Plural" = "Comptes Bancaires";
"BankAccount.New" = "Nouveau Compte Bancaire";

"BankAccount.Properties.accountHolder" = "Titulaire du Compte";
"BankAccount.Properties.bankName" = "Banque";
"BankAccount.Properties.iban" = "IBAN";
"BankAccount.Properties.number" = "Numéro du Compte";
"BankAccount.Properties.routingNumber" = "Numéro de Routage";
"BankAccount.Properties.swiftCode" = "SWIFT";

// Credit card
"CreditCard.Single" = "Carte de Crédit";
"CreditCard.Plural" = "Cartes de Crédit";
"CreditCard.New" = "Nouvelle Carte de Crédit";

"CreditCard.Brand.visa" = "Visa";
"CreditCard.Brand.mastercard" = "MasterCard";
"CreditCard.Brand.amex" = "American Express";
"CreditCard.Brand.diners" = "Diners Club";
"CreditCard.Brand.discover" = "Discover";
"CreditCard.Brand.jcb" = "JCB";
"CreditCard.Brand.solo" = "Solo";
"CreditCard.Brand.maestro" = "Maestro";
"CreditCard.Brand.visaelectron" = "Visa Electron";
"CreditCard.Brand.other" = "Autre";

"CreditCard.Properties.pan" = "Numéro de Carte";
"CreditCard.Properties.cardholder" = "Titulaire de la Carte";
"CreditCard.Properties.expirationDate" = "Date d'Expiration";
"CreditCard.Properties.brand" = "Marque";
"CreditCard.Properties.pin" = "PIN";
"CreditCard.Properties.securityCode" = "Code de Sécurité";

"CreditCard.Errors.InvalidPAN" = "Le numéro de carte de crédit doit être une suite de chiffres";

// Notes
"Note.Single" = "Note";
"Note.Plural" = "Notes";
"Note.New" = "Nouvelle Note";
"Note.Items" = "%d note(s)";

// Service
"Service.URL" = "URL";

"Service.Properties.address" = "adresse";

"Service.Errors.InvalidAddress" = "L'adresse d'un service doit être une URL valide";

// One-Time Passwords
"OneTimePassword.Single" = "Mot de passe à Usage Unique";
"OneTimePassword.Plural" = "Mots de passe à Usage Unique";
"OneTimePassword.Seed.Long" = "Secret du Mot de Passe à Usage Unique";
"OneTimePassword.Seed.Short" = "Secret MdP Usage Unique";

